"espk" = "Cổng loa Apple";
"ispk" = "Tích hợp";
"emic" = "Cổng micrô";
"imic" = "Tích hợp";
"hdpn" = "Cổng tai nghe";
"lini" = "Cổng ngõ vào âm thanh";
"lino" = "Cổng ngõ ra âm thanh";
"spdi" = "Cổng vào kỹ thuật số quang học";
"spdo" = "Cổng ra kỹ thuật số quang học";
"pci " = "Thẻ PCI";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Thiết bị mạng";
"blue" = "Bluetooth";
"bluh" = "Tai nghe Bluetooth";
"blus" = "Tai nghe Bluetooth";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
